In [1]:
import pandas as pd

C:\Users\SOURABH\anaconda3\lib\site-packages\pandas\core\computation\expressions.py:21: UserWarning: Pandas requires version '2.8.4' or newer of 'numexpr' (version '2.8.1' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED
C:\Users\SOURABH\anaconda3\lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.4' currently installed).
  from pandas.core import (

In [2]:
dates = ['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04', '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08', '2018-01-09', '2018-01-10', '2018-01-11', '2018-01-12', '2018-01-13', '2018-01-14', '2018-01-15', '2018-01-16', '2018-01-17', '2018-01-18', '2018-01-19', '2018-01-20', '2018-01-21', '2018-01-22', '2018-01-23', '2018-01-24', '2018-01-25', '2018-01-26', '2018-01-27', '2018-01-28', '2018-01-29', '2018-01-30', '2018-01-31', '2018-02-01', '2018-02-02', '2018-02-03', '2018-02-04', '2018-02-05', '2018-02-06', '2018-02-07', '2018-02-08', '2018-02-09', '2018-02-10', '2018-02-11', '2018-02-12', '2018-02-13', '2018-02-14', '2018-02-15', '2018-02-16', '2018-02-17', '2018-02-18', '2018-02-19', '2018-02-20', '2018-02-21', '2018-02-22', '2018-02-23', '2018-02-24', '2018-02-25', '2018-02-26', '2018-02-27', '2018-02-28', '2018-03-01', '2018-03-02', '2018-03-03', '2018-03-04', '2018-03-05', '2018-03-06', '2018-03-07', '2018-03-08', '2018-03-09', '2018-03-10', '2018-03-11', '2018-03-12', '2018-03-13', '2018-03-14', '2018-03-15', '2018-03-16', '2018-03-17', '2018-03-18', '2018-03-19', '2018-03-20', '2018-03-21', '2018-03-22', '2018-03-23', '2018-03-24', '2018-03-25', '2018-03-26', '2018-03-27', '2018-03-28', '2018-03-29', '2018-03-30', '2018-03-31', '2018-04-01', '2018-04-02', '2018-04-03', '2018-04-04', '2018-04-05', '2018-04-06', '2018-04-07', '2018-04-08', '2018-04-09', '2018-04-10', '2018-04-11', '2018-04-12', '2018-04-13', '2018-04-14', '2018-04-15', '2018-04-16', '2018-04-17', '2018-04-18', '2018-04-19', '2018-04-20', '2018-04-21', '2018-04-22', '2018-04-23', '2018-04-24', '2018-04-25', '2018-04-26', '2018-04-27', '2018-04-28', '2018-04-29', '2018-04-30', '2018-05-01', '2018-05-02', '2018-05-03', '2018-05-04', '2018-05-05', '2018-05-06', '2018-05-07', '2018-05-08', '2018-05-09', '2018-05-10', '2018-05-11', '2018-05-12', '2018-05-13', '2018-05-14', '2018-05-15', '2018-05-16', '2018-05-17', '2018-05-18', '2018-05-19', '2018-05-20', '2018-05-21', '2018-05-22', '2018-05-23', '2018-05-24', '2018-05-25', '2018-05-26', '2018-05-27', '2018-05-28', '2018-05-29', '2018-05-30', '2018-05-31', '2018-06-01', '2018-06-02', '2018-06-03', '2018-06-04', '2018-06-05', '2018-06-06', '2018-06-07', '2018-06-08', '2018-06-09', '2018-06-10', '2018-06-11', '2018-06-12', '2018-06-13', '2018-06-14', '2018-06-15', '2018-06-16', '2018-06-17', '2018-06-18', '2018-06-19', '2018-06-20', '2018-06-21', '2018-06-22', '2018-06-23', '2018-06-24', '2018-06-25', '2018-06-26', '2018-06-27', '2018-06-28', '2018-06-29', '2018-06-30', '2018-07-01', '2018-07-02', '2018-07-03', '2018-07-04', '2018-07-05', '2018-07-06', '2018-07-07', '2018-07-08', '2018-07-09', '2018-07-10', '2018-07-11', '2018-07-12', '2018-07-13', '2018-07-14', '2018-07-15', '2018-07-16', '2018-07-17', '2018-07-18', '2018-07-19', '2018-07-20', '2018-07-21', '2018-07-22', '2018-07-23', '2018-07-24', '2018-07-25', '2018-07-26', '2018-07-27', '2018-07-28', '2018-07-29', '2018-07-30', '2018-07-31', '2018-08-01', '2018-08-02', '2018-08-03', '2018-08-04', '2018-08-05', '2018-08-06', '2018-08-07', '2018-08-08', '2018-08-09', '2018-08-10', '2018-08-11', '2018-08-12', '2018-08-13', '2018-08-14', '2018-08-15', '2018-08-16', '2018-08-17', '2018-08-18', '2018-08-19', '2018-08-20', '2018-08-21', '2018-08-22', '2018-08-23', '2018-08-24', '2018-08-25', '2018-08-26', '2018-08-27', '2018-08-28', '2018-08-29', '2018-08-30', '2018-08-31', '2018-09-01', '2018-09-02', '2018-09-03', '2018-09-04', '2018-09-05', '2018-09-06', '2018-09-07', '2018-09-08', '2018-09-09', '2018-09-10', '2018-09-11', '2018-09-12', '2018-09-13', '2018-09-14', '2018-09-15', '2018-09-16', '2018-09-17', '2018-09-18', '2018-09-19', '2018-09-20', '2018-09-21', '2018-09-22', '2018-09-23', '2018-09-24', '2018-09-25', '2018-09-26', '2018-09-27', '2018-09-28', '2018-09-29', '2018-09-30', '2018-10-01', '2018-10-02', '2018-10-03', '2018-10-04', '2018-10-05', '2018-10-06', '2018-10-07', '2018-10-08', '2018-10-09', '2018-10-10', '2018-10-11', '2018-10-12', '2018-10-13', '2018-10-14', '2018-10-15', '2018-10-16', '2018-10-17', '2018-10-18', '2018-10-19', '2018-10-20', '2018-10-21', '2018-10-22', '2018-10-23', '2018-10-24', '2018-10-25', '2018-10-26', '2018-10-27', '2018-10-28', '2018-10-29', '2018-10-30', '2018-10-31', '2018-11-01', '2018-11-02', '2018-11-03', '2018-11-04', '2018-11-05', '2018-11-06', '2018-11-07', '2018-11-08', '2018-11-09', '2018-11-10', '2018-11-11', '2018-11-12', '2018-11-13', '2018-11-14', '2018-11-15', '2018-11-16', '2018-11-17', '2018-11-18', '2018-11-19', '2018-11-20', '2018-11-21', '2018-11-22', '2018-11-23', '2018-11-24', '2018-11-25', '2018-11-26', '2018-11-27', '2018-11-28', '2018-11-29', '2018-11-30', '2018-12-01', '2018-12-02', '2018-12-03', '2018-12-04', '2018-12-05', '2018-12-06', '2018-12-07', '2018-12-08']
units_sold = [147, 342, 380, 292, 114, 311, 339, 90, 446, 302, 149, 362, 165, 103, 90, 473, 24, 391, 472, 427, 294, 169, 116, 378, 62, 296, 33, 89, 485, 224, 404, 281, 137, 238, 381, 335, 121, 182, 6, 376, 46, 445, 353, 377, 61, 119, 245, 302, 49, 72, 350, 376, 254, 432, 80, 120, 151, 167, 44, 123, 390, 456, 410, 64, 155, 406, 6, 326, 199, 32, 24, 76, 174, 376, 325, 517, 255, 81, 70, 339, 395, 484, 408, 386, 362, 353, 207, 52, 435, 360, 430, 410, 491, 168, 378, 120, 308, 486, 67, 287, 258, 354, 319, 123, 35, 235, 304, 342, 407, 36, 257, 270, 1, 140, 456, 466, 6, 8, 446, 451, 44, 430, 431, 256, 470, 400, 231, 178, 435, 109, 405, 450, 375, 278, 136, 272, 444, 111, 109, 232, 285, 492, 162, 10, 86, 180, 302, 198, 463, 341, 351, 155, 47, 90, 202, 404, 52, 483, 510, 500, 413, 164, 496, 212, 162, 302, 103, 362, 16, 495, 181, 9, 63, 311, 424, 398, 170, 325, 236, 188, 396, 457, 106, 355, 299, 319, 308, 220, 253, 440, 373, 493, 475, 387, 376, 240, 184, 269, 406, 180, 374, 228, 378, 322, 380, 211, 309, 124, 37, 42, 367, 173, 252, 278, 518, 163, 102, 304, 197, 206, 266, 24, 134, 255, 453, 228, 139, 195, 395, 428, 414, 246, 299, 315, 321, 289, 35, 38, 314, 97, 77, 359, 299, 375, 410, 228, 223, 16, 454, 62, 96, 270, 65, 477, 392, 506, 333, 164, 46, 184, 149, 62, 387, 187, 358, 27, 328, 411, 201, 45, 231, 98, 237, 46, 391, 69, 452, 239, 267, 193, 486, 70, 8, 14, 299, 487, 412, 453, 112, 12, 279, 459, 20, 429, 86, 109, 132, 133, 403, 30, 169, 377, 486, 407, 306, 185, 457, 408, 280, 384, 119, 92, 40, 318, 120, 372, 44, 115, 214, 452, 41, 417, 102, 44, 1, 247, 178, 240, 80, 388, 209, 439, 345, 125, 243, 381, 377, 196, 504, 352, 322, 336]

In [6]:
df = pd.DataFrame({'dates':dates,'units_sold':units_sold})

In [7]:
df

          dates  units_sold
0    2018-01-01         147
1    2018-01-02         342
2    2018-01-03         380
3    2018-01-04         292
4    2018-01-05         114
..          ...         ...
337  2018-12-04         196
338  2018-12-05         504
339  2018-12-06         352
340  2018-12-07         322
341  2018-12-08         336

[342 rows x 2 columns]

In [23]:
df['dates'] = pd.to_datetime(df['dates'])

#engineer a feature consisting of the number of month for each observation
df['month'] = df['dates'].dt.month

In [24]:
df

,dates,units_sold,month,average_sales
0,2018-01-01,147,1,<bound method Series.reset_index of month\n01 ...
1,2018-01-02,342,1,<bound method Series.reset_index of month\n01 ...
2,2018-01-03,380,1,<bound method Series.reset_index of month\n01 ...
3,2018-01-04,292,1,<bound method Series.reset_index of month\n01 ...
4,2018-01-05,114,1,<bound method Series.reset_index of month\n01 ...
...,...,...,...,...
337,2018-12-04,196,12,<bound method Series.reset_index of month\n01 ...
338,2018-12-05,504,12,<bound method Series.reset_index of month\n01 ...
339,2018-12-06,352,12,<bound method Series.reset_index of month\n01 ...
340,2018-12-07,322,12,<bound method Series.reset_index of month\n01 ...
341,2018-12-08,336,12,<bound method Series.reset_index of month\n01 ...

In [27]:
#Construct a feature consisting of average sales for each month
ans = df.groupby('month')['units_sold'].mean().reset_index().round(2)
print(ans)

    month  units_sold
0       1      257.06
1       2      217.86
2       3      266.00
3       4      268.63
4       5      279.55
5       6      262.30
6       7      293.06
7       8      246.45
8       9      234.07
9      10      242.87
10     11      225.40
11     12      338.88

In [26]:


#engineer a feature consisting of the number of month for each observation
df['month'] = df['dates'].dt.month

#Construct a feature consisting of average sales for each month
df['average_sales'] = df.groupby(['month'])['units_sold'].transform('mean').round(2)

#retrieving all the months and average sales from the data
ans = df[['month', 'average_sales']].drop_duplicates()

#Reset the index of ans dataframe
ans.reset_index(drop=True,inplace=True)

print(ans)

    month  average_sales
0       1         257.06
1       2         217.86
2       3         266.00
3       4         268.63
4       5         279.55
5       6         262.30
6       7         293.06
7       8         246.45
8       9         234.07
9      10         242.87
10     11         225.40
11     12         338.88

In [28]:
Start_station = ['Broad St', '66 St-Lincoln Center', '86th St', 'Times Sq - 42 St', '86th St', 'Bowery', '66 St-Lincoln Center', '66 St-Lincoln Center', '14 St / 8 Av', 'Times Sq - 42 St']
End_station = ['14 St / 8 Av', 'Bowery', 'Bowery', '66 St-Lincoln Center', '66 St-Lincoln Center', 'Broad St', 'Broad St', 'Broad St', '14 St / 8 Av', 'Times Sq - 42 St']
Duration = [0.12, 1.94, 2.47, 1.53, 2.76, 1.93, 0.33, 0.94, 2.71, 1.39]

In [31]:
df2 = pd.DataFrame({'start_st':Start_station,'end_st':End_station,'Duration':Duration})

In [32]:
df2

               start_st                end_st  Duration
0              Broad St          14 St / 8 Av      0.12
1  66 St-Lincoln Center                Bowery      1.94
2               86th St                Bowery      2.47
3      Times Sq - 42 St  66 St-Lincoln Center      1.53
4               86th St  66 St-Lincoln Center      2.76
5                Bowery              Broad St      1.93
6  66 St-Lincoln Center              Broad St      0.33
7  66 St-Lincoln Center              Broad St      0.94
8          14 St / 8 Av          14 St / 8 Av      2.71
9      Times Sq - 42 St      Times Sq - 42 St      1.39

In [34]:
rides = (df2['start_st']==df2['end_st'])

In [36]:
df2[rides]['Duration'].median()

2.05

In [40]:
import numpy as np
df = {'date':['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04', '2018-01-05', '2018-01-06'], 'units_sold':[6519.0, 6654.0, 7332.0, np.nan, 7211.0, 6882.0]}
window_size = 3

In [45]:
df = pd.DataFrame(df)

In [46]:
df

         date  units_sold
0  2018-01-01      6519.0
1  2018-01-02      6654.0
2  2018-01-03      7332.0
3  2018-01-04         NaN
4  2018-01-05      7211.0
5  2018-01-06      6882.0

In [62]:
df['units_sold'] = df['units_sold'].fillna(df['units_sold'].rolling(window=window_size+1, min_periods=1).mean())

In [63]:
df

         date  units_sold
0  2018-01-01      6519.0
1  2018-01-02      6654.0
2  2018-01-03      7332.0
3  2018-01-04      6835.0
4  2018-01-05      7211.0
5  2018-01-06      6882.0